other-codes/elastic-tube-causin-main/fluid-openfoam/0/phi
FoamFile
{
    version     2.0;
    format      ascii;
    class       surfaceScalarField;
    location    "0";
    object      phi;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 3 -1 0 0 0 0];

internalField   uniform 0;
boundaryField
{
    inlet
    {
        type            calculated;
        value           $internalField;
    }
    outlet
    {
        type            calculated;
        value           $internalField;
    }
    fluidBoundary
    {
        type            symmetryPlane;
        value           uniform 0;
    }
    pipeBoundary
    {
        type            calculated;
        value           uniform 0;
    }
    frontAndBack
    {
        type            empty;
        value           nonuniform 0;
    }
}


// ************************************************************************* //
